Revit 2027 API
FilterableValueProvider.GetIntegerValue Method
 Gets an integer value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetIntegerValue(
	Element element
)
Public Function GetIntegerValue (
	element As Element
) As Integer
public:
int GetIntegerValue(
	Element^ element
)
member GetIntegerValue :
        element : Element -> int
Parameters
element Element
 The element to query.
Return Value
Int32
 The integer value from the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace